<?php
const DEFAULT_SITE_LANG = "ckb";
const SITE_LANGS = [
	"ckb" => [
		"dir" => "rtl",
		"align" => "right",
		"cc" => "ckb",
		"lit" => "کوردیی سۆرانی",
	],
	"fa" => [
		"dir" => "rtl",
		"align" => "right",
		"cc" => "fa",
		"lit" => "فارسی",
	],
	/* "ku" => [
	   "dir" => "ltr",
	   "align" => "left",
	   "cc" => "ku",
	   "lit" => "Kurdî",
	 * ],
	 * "en" => [
	   "dir" => "ltr",
	   "align" => "left",
	   "cc" => "en",
	   "lit" => "English",
	 * ], */
];
function SP ($key)
{
	global $site_lang, $Ps;
	return @$Ps[$key][$site_lang];
}
function P ($key)
{
	echo SP($key);
}
$Ps = [
	"title" => [
		"ckb" => "ئاڵەکۆک",
		"fa" => "ئاڵەکۆک",
		"ku" => "Allekok",
		"en" => "Allekok",
	],
	"desc" => [
		"ckb" => "هۆنراوەی کوردی",
		"fa" => "شعر کردی",
		"ku" => "",
		"en" => "Kurdish poems",
	],
	"keys" => [
		"ckb" => "ئاڵەکۆک,شێعر,شاعیر,بەیت,چیرۆک,هەڵبەست,شیعر,کورد,کوردستان,ئەدەب",
		"fa" => "ئاڵەکۆک,شعر,شاعر,ادبیات,کرد,کردستان",
		"ku" => "",
		"en" => "",
	],
	"search for" => [
		"ckb" => "گەڕان بۆ ...",
		"fa" => "جست‌وجو ...",
		"ku" => "",
		"en" => "Search for ...",
	],
	"top" => [
		"ckb" => "چوونە سەرەوە",
		"fa" => "رفتن به ابتدای صفحه",
		"ku" => "",
		"en" => "Go to top",
	],
	"dead poets" => [
		"ckb" => "هۆنەرانی کۆچ‌کردوو",
		"fa" => "شاعران فوت‌شده",
		"ku" => "",
		"en" => "",
	],
	"new poets" => [
		"ckb" => "هۆنەرانی نوێ",
		"fa" => "شاعران هم‌عصر",
		"ku" => "",
		"en" => "New poets",
	],
	"beyt" => [
		"ckb" => "بەیتی کوردی",
		"fa" => "بیت کردی",
		"ku" => "",
		"en" => "Kurdish Beyt",
	],
	"new poets desc" => [
		"ckb" => "مەبەست لە هۆنەرانی نوێ، ئەو هۆنەرانەن کە لە ژیان دا ماون. تکایە ئەگەر دەتوانن کتێبەکانیان لە کتێبفرۆشیەکان بکڕن.",
		"fa" => "این شاعران هم‌اکنون در قید حیات هستند. لطفا در صورت امکان کتاب‌هایشان را از کتابفروشی‌ها تهیه کنید.",
		"ku" => "",
		"en" => "",
	],
	"donate" => [
		"ckb" => "یارمەتیی ماڵی",
		"fa" => "کمک مالی",
		"ku" => "",
		"en" => "Donate",
	],
	"about allekok" => [
		"ckb" => "سەبارەت بە ئاڵەکۆک",
		"fa" => "درباره ئاڵەکۆک",
		"ku" => "",
		"en" => "About Allekok",
	],
	"allekok?" => [
		"ckb" => "ئاڵەکۆک؟",
		"fa" => "ئاڵەکۆک؟",
		"ku" => "Allekok?",
		"en" => "Allekok?",
	],
	"allekok news" => [
		"ckb" => "تازەکانی ئاڵەکۆک",
		"fa" => "تازه‌های ئاڵەکۆک",
		"ku" => "",
		"en" => "New poems",
	],
	"news" => [
		"ckb" => "تازەکان",
		"fa" => "تازه‌ها",
		"ku" => "",
		"en" => "News",
	],
	"allekok pitew" => [
		"ckb" => "پتەوکردنی ئاڵەکۆک",
		"fa" => "تنومند‌کردن ئاڵەکۆک",
		"ku" => "",
		"en" => "Make Allekok better",
	],
	"pitew" => [
		"ckb" => "پتەوکردن",
		"fa" => "تنومندکردن",
		"ku" => "",
		"en" => "Betterization",
	],
	"thanks.." => [
		"ckb" => "سپاس و پێزانین",
		"fa" => "سپاس",
		"ku" => "",
		"en" => "Thanks",
	],
	"thanks" => [
		"ckb" => "سپاس",
		"fa" => "سپاس",
		"ku" => "",
		"en" => "Thanks",
	],
	"desktop" => [
		"ckb" => "دابەزاندنی بەرنامەی ئاڵەکۆک",
		"fa" => "دریافت برنامه ئاڵەکۆک",
		"ku" => "",
		"en" => "Download Allekok application",
	],
	"code" => [
		"ckb" => "کۆد",
		"fa" => "توسعه‌دهندگان",
		"ku" => "",
		"en" => "Developers",
	],
	"customize" => [
		"ckb" => "گۆڕانکاری",
		"fa" => "ویرایش ظاهری",
		"ku" => "",
		"en" => "Customize",
	],
	"language" => [
		"ckb" => "زمان",
		"fa" => "زبان",
		"ku" => "",
		"en" => "Language",
	],
	"ناردنی وێنە" => [
		"ckb" => "ناردنی وێنە",
		"fa" => "ارسال نگاره",
		"ku" => "",
		"en" => "",
	],
	"بەرهەمەکان" => [
		"ckb" => "بەرهەمەکان",
		"fa" => "آثار",
		"ku" => "",
		"en" => "",
	],
	"بەیتەکان" => [
		"ckb" => "بەیتەکان",
		"fa" => "بیت‌ها",
		"ku" => "",
		"en" => "",
	],
	"سەبارەت" => [
		"ckb" => "سەبارەت",
		"fa" => "درباره",
		"ku" => "",
		"en" => "",
	],
	"وێنەکان" => [
		"ckb" => "وێنەکان",
		"fa" => "نگاره‌ها",
		"ku" => "",
		"en" => "",
	],
	"زانیارییەکانی بەکارهێنەران" => [
		"ckb" => "زانیارییەکانی بەکارهێنەران",
		"fa" => "داده‌های کاربران",
		"ku" => "",
		"en" => "",
	],
	"book-completed" => [
		"ckb" => "تەواوی ئەو کتێبە لە سەر ئاڵەکۆک، نووسراوەتەوە",
		"fa" => "این کتاب به صورت کامل در ئاڵەکۆک بازنویسی شده‌است",
		"ku" => "",
		"en" => "",
	],
	"ئا" => [
		"ckb" => "ئا",
		"fa" => "آ",
		"ku" => "A",
		"en" => "A",
	],
	"نووسینی شیعرێکی تازە" => [
		"ckb" => "نووسینی هۆنراوەیەکی تازە",
		"fa" => "افزودن شعر",
		"ku" => "",
		"en" => "",
	],
	"copyright" => [
		"ckb" => "مافی کۆپی‌کردن",
		"fa" => "حق کپی‌رایت",
		"ku" => "",
		"en" => "Copyright",
	],
	"poem-snippet" => [
		"ckb" => "نیشان‌دانی بەشی سەرەتایی ئەم هۆنراوە",
		"fa" => "نمایش‌دادن بخش آغازین این شعر",
		"ku" => "",
		"en" => "",
	],
	"random-poem" => [
		"ckb" => "هات‌ونەهات",
		"fa" => "یا شانس",
		"ku" => "",
		"en" => "I'm feeling lucky",
	],
	"random-poem-title" => [
		"ckb" => "هۆنراوەیەک بە هەڵکەوت",
		"fa" => "",
		"ku" => "",
		"en" => "I'm feeling lucky",
	],
	"allekok-apps" => [
		"ckb" => "بەرنامەکانی ئاڵەکۆک",
		"fa" => "برنامه‌های ئاڵەکۆک",
		"ku" => "",
		"en" => "",
	],
	"داگرتنی ئەم کتێبە" => [
		"ckb" => "داگرتنی ئەم کتێبە",
		"fa" => "دریافت این کتاب",
		"ku" => "",
		"en" => "",
	],
	"" => [
		"ckb" => "",
		"fa" => "",
		"ku" => "",
		"en" => "",
	],
];
?>
